# ================ #
# disease and diet eating
# ================ #
disease_advice_db = {
    "痛风": {"膳食": "建议您低嘌呤饮食，保持合理体重，戒酒，多饮水，每日饮水2000ml以上"},
    "2型糖尿病": "",
    "甲状腺机能减退症": "",
    "脑动脉瘤": "脑动脉瘤",
    "高血压": "",
    "高血脂": "",
    "冠心病": "",
    "脑中风": "",
    "静脉血栓栓塞": "",
    "心脏性猝死": "",
    "慢性肾病": "",
    "肾结石": "",
    "胆结石": "",
    "酒精性脂肪肝": "",
    "非酒精性脂肪性肝病": "",
    "阿尔兹海默氏症": "",
    "帕金森": "",
    "抑郁症": "",
    "双相型障碍": "",
    "肺癌": "",
    "胃癌": "",
    "食管癌": "",
    "结直肠癌": "",
    "胰腺癌": "",
    "甲状腺癌": "",
    "鼻咽癌": "",
    "肝癌": "",
    "口腔癌": "",
    "喉癌": "",
    "慢性淋巴细胞白血病": "",
    "前列腺癌": "",
    "睾丸癌": "",
    "骨质疏松": "",
    "强直性脊柱炎": {"运动": "建议每天通过吊单杠 4 次以上来缓解脊柱压力"},
    "骨关节炎": "",
    "腰椎间盘突出症": ""
}

kwz_advice_db = {
    "钙": "建议您可适当多晒太阳，以促进钙的吸收",
    "铁": "建议您可在饭后适当服用补铁制剂，且尽量多用铁锅炒菜而少用铝锅",
    "锌": "建议您可多吃一些含锌量高的动物性食品（如肝脏）和海产品（如牡蛎、虾等），必要时也可服用营养补剂",
    "镁": "建议您适量补充镁,强健牙齿和骨骼"
}

"""
vitamin_advice_db = {
    "维生素A": "A",
    "维生素B12": "B12",
    "维生素D": "D",
    "维生素E": "E",
    "叶酸": "叶酸",
    "维生素B6": "B6",
    "维生素B2": "B2",
    "维生素C": "C",
}
"""
vitamin_advice_db = {
    "B族和其他": "建议您服用 B 族维生素和",
    "仅B族": "建议您服用 B 族维生素",
    "仅其他": "建议您服用",
    "叶酸": "叶酸需要补充特殊类型的叶酸以保证叶酸的吸收"
}

jiuj = {
    "酒精": {
        "戒酒": "强烈建议您戒酒",
        "浅尝": "建议您尽量少或者不饮酒",
        "小酌": "建议您尽量少或者不饮酒"
    }
}

rut = {
    "乳糖": "钙的补充由于乳糖不耐受建议通过无糖酸奶补充,不建议全脂牛奶"
}

kafy = {
    "咖啡因": "建议您尽量不要饮用咖啡、奶茶等富含咖啡因的饮料，建议您多喝凉白开"
}

shansxw = {
    "膳食纤维": "香蕉可以有效补充钾、膳食纤维"
}

zhifs = {
    "Ω-3脂肪酸": "建议您可适当食用深海鱼油、含有α-亚麻酸的植物油例如亚麻籽油、海藻油以保证Ω-3脂肪酸的需求"
}

yundong_tangniaobing = {
    "运动对糖尿病的帮助": "运动能有效控制高血压和糖尿病风险,成效显著"
}

# ================ #
# sport advice
# ================ #
sport_advices = {
    "通用1": "每次力量训练 30 分钟和有氧运动 15 分钟的配合能有效提升身体免疫能力",
    "通用2": "注意晒太阳,增加钙的吸收"
}

# ================ #
# social action advice:社交类建议可从两处来，1是从精神系统疾病，2是从通用建议
# ================ #
social_advices = {
    "通用1": "保持一定程度的社交和沟通,注意家人和朋友的陪伴",
    "通用2": "尽量参加社会活动,强化脑部神经"
}





